Feature: Comment feature
  Отговаря за постването на коментари в теми само от регистрирани потребители 
  Scenario: Успешно постване на коментар
    Given Потребител отваря форум страницата
    And се е регистрирал в системата
    And се е логнал в системата
    And натисне на съществуваща тема на сайта
    And визуализира се страница за темата
    And натисне бутон за писане на коментар 
    And визуализира се попъп за писане на коментар
    When въведе валидно съобщение
    And натисне бутона за постване
    Then Потребител вижда съобщение "Коментарът ви е публикуван успешно!"

 Scenario: Постване на празен коментар
  Given Потребител отваря форум страницата
    And се е регистрирал в системата
    And се е логнал в системата
    And натисне на съществуваща тема на сайта
    And визуализира се страница за темата
    And натисне бутон за писане на коментар 
    And визуализира се попъп за писане на коментар
    When въведе празно съобщение			
    #Maybe ^^^ needs to be gone completely? Or made into it's own scenario for specific Empty string?
    And натисне бутона за постване
    Then Потребител вижда съобщение "Въведете коментар!"
    
 Scenario: Постване на твърде дълъг коментар
  Given Потребител отваря форум страницата
    And се е регистрирал в системата
    And се е логнал в системата
    And натисне на съществуваща тема на сайта
    And визуализира се страница за темата
    And натисне бутон за писане на коментар 
    And визуализира се попъп за писане на коментар
    When въведе прекалено дългъг коментар
    And натисне бутона за постване
    Then Потребител вижда съобщение "Превишена дължина на коментар!"